In [1]:
import numpy as np
import pandas as pd

In [2]:
X = [7, 8, 9, 6]
W = [4, 3, 2, 5]

In [3]:
def ANN(X, W):
    weighted_sum = np.dot(X, np.transpose(W))
    output = weighted_sum/sum(W)
    if(output < 0.6):
        return 0
    else:return 1

In [4]:
df = pd.read_csv('marks.csv')

In [5]:
df

   1st  2nd  3rd  4th
0    7    6    6    4
1    8    3    2    6
2    4    2    1    2
3    1    1    7    7
4    2    2    9    5
5    3    1    3    9
6    5    5    7    8
7    8    7    8    6
8    1    9    9    4
9    9    8    6    2

In [6]:
df.iloc[0]

1st    7
2nd    6
3rd    6
4th    4
Name: 0, dtype: int64

In [7]:
for i in range(10):
    print(ANN(df.iloc[i], W))

1
1
1
1
1
1
1
1
1
1

In [13]:
df = df.drop('3rd', axis=1)

In [14]:
df = df.drop('4th', axis=1)

In [15]:
df

   1st  2nd
0    7    6
1    8    3
2    4    2
3    1    1
4    2    2
5    3    1
6    5    5
7    8    7
8    1    9
9    9    8

In [18]:
W1 = [4, 5]
W2 = [6, 7]
W3 = [1, 2]
def new_ANN(X):
    weighted_sum = []
    weighted_sum.append(np.dot(X, np.transpose(W1)))
    weighted_sum.append(np.dot(X, np.transpose(W2)))
    output =  np.dot(weighted_sum, np.transpose(W3))
    return output

In [19]:
for i in range(10):
    print(new_ANN(df.iloc[i]))

226
185
102
35
70
67
175
261
187
296